Tekla.Structures.Model.ModelObject.GetIntegerReportProperties(System.Collections.ArrayList,System.Collections.Hashtable@)
Retrieves multiple integer report properties for the model object. It is faster
to fetch multiple properties at once.
Names: An array list containing the names of the properties.
Values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ModelObject.GetDoubleReportProperties(System.Collections.ArrayList,System.Collections.Hashtable@)
Retrieves multiple double report properties for the model object. It is faster
to fetch multiple properties at once.
Names: An array list containing the names of the properties.
Values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ModelObject.GetStringReportProperties(System.Collections.ArrayList,System.Collections.Hashtable@)
Retrieves multiple string report properties for the model object. It is faster
to fetch multiple properties at once.
Names: An array list containing the names of the properties.
Values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ModelObject.GetUserProperty(System.String,System.String@)
Retrieves a string property for the model object.
Name: The name of the property to be retrieved.
Value: The return value.
Returns: True if the value was returned successfully.

Tekla.Structures.Model.ModelObject.GetReportProperty(System.String,System.String@)
Retrieves a string property of the report for the model object.
Name: The name of the property to be retrieved.
Value: The return value.
Returns: True if the value was returned successfully.

Tekla.Structures.Model.ModelObject.GetUserProperty(System.String,System.Double@)
Retrieves a double property for the model object.
Name: The name of the property to be retrieved.
Value: The return value.
Returns: True if the value was returned successfully.

Tekla.Structures.Model.ModelObject.GetReportProperty(System.String,System.Double@)
Retrieves a double property of the report for the model object.
Name: The name of the property to be retrieved.
Value: The return value.
Returns: True if the value was returned successfully.

Tekla.Structures.Model.ModelObject.GetUserProperty(System.String,System.Int32@)
Retrieves an integer property for the model object.
Name: The name of the property to be retrieved.
Value: The return value.
Returns: True if the value was returned successfully.

Tekla.Structures.Model.ModelObject.GetReportProperty(System.String,System.Int32@)
Retrieves an integer property of the report for the model object.
Name: The name of the property to be retrieved.
Value: The return value.
Returns: True if the value was returned successfully.